In [10]:
import pandas as pd
days = pd.Series(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'])
days[:4]

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
dtype: object

In [4]:
import numpy as np
import pandas as pd
dayss = ['Monday', 'Tuesday', 'Wednesday']
dayslist = np.array(dayss)
numpy_days = pd.Series(dayslist)
numpy_days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [11]:
# creating Pandas Series from dictionary
import pandas as pd
my_dict = {'a': 'Monday', 'b': 'Tuesday', 'c': 'Wednesday'}
pdays = pd.Series(my_dict)
pdays

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [14]:
import pandas as pd
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [19]:
# Creating DataFrame from dictionary
import pandas as pd
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60, 70, 80, 75]
}
df = pd.DataFrame(df_dict, index=[2, 4, 6, 8])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [39]:
df.loc[2]

Country       Ghana
Capital       Accra
Population    10000
Age              60
Name: 2, dtype: object

In [25]:
# select the Capital column
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [26]:
df.at[6, 'Country']

'Nigeria'

In [27]:
df.iat[2, 0]

'Nigeria'

In [28]:
df['Population'].sum()

65500

In [29]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [31]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [36]:
import pandas as pd
new_dict = {'Names': ['Ned', 'Mark', 'Archer'],
           'Profession': ['Engineer', 'Doctor', np.nan]}

new_df = pd.DataFrame(new_dict, index = [7, 8, 9])
new_df

    Names Profession
7     Ned   Engineer
8    Mark     Doctor
9  Archer        NaN

In [45]:
new_df.isnull()

   Names  Profession
7  False       False
8  False       False
9  False        True

In [46]:
new_df.fillna('Writer')

    Names Profession
7     Ned   Engineer
8    Mark     Doctor
9  Archer     Writer